; domain
(define (domain maze)
    (:requirements :strips :typing )
    (:types player location)
    (:predicates 
        (move-dir-up ?v0 - location ?v1 - location)
        (move-dir-down ?v0 - location ?v1 - location)
        (move-dir-left ?v0 - location ?v1 - location)
        (move-dir-right ?v0 - location ?v1 - location)
        (clear ?v0 - location)
        (at ?v0 - player ?v1 - location)
        (oriented-up ?v0 - player)
        (oriented-down ?v0 - player)
        (oriented-left ?v0 - player)
        (oriented-right ?v0 - player)
        (is-goal ?v0 - location)
    )
    (:action wait
        :parameters (?p - player ?where - location)
        :precondition (and (at ?p ?where) (is-goal ?where))
        :effect (at ?p ?where)
    )
    (:action move-up
            :parameters (?p - player ?from - location ?to - location)
            :precondition (and (at ?p ?from)
                    (clear ?to)
                    (move-dir-up ?from ?to))
            :effect (and
                    (not (at ?p ?from))
                    (not (clear ?to))
                    (at ?p ?to)
                    (clear ?from)
                    (not (oriented-down ?p))
                    (not (oriented-left ?p))
                    (not (oriented-right ?p))
                    (oriented-up ?p))
    )

    (:action move-down
            :parameters (?p - player ?from - location ?to - location)
            :precondition (and (at ?p ?from)
                    (clear ?to)
                    (move-dir-down ?from ?to))
            :effect (and
                    (not (at ?p ?from))
                    (not (clear ?to))
                    (at ?p ?to)
                    (clear ?from)
                    (not (oriented-up ?p))
                    (not (oriented-left ?p))
                    (not (oriented-right ?p))
                    (oriented-down ?p))
    )

    (:action move-left
            :parameters (?p - player ?from - location ?to - location)
            :precondition (and (at ?p ?from)
                    (clear ?to)
                    (move-dir-left ?from ?to))
            :effect (and
                    (not (at ?p ?from))
                    (not (clear ?to))
                    (at ?p ?to)
                    (clear ?from)
                    (not (oriented-down ?p))
                    (not (oriented-up ?p))
                    (not (oriented-right ?p))
                    (oriented-left ?p))
    )


    (:action move-right
            :parameters (?p - player ?from - location ?to - location)
            :precondition (and (at ?p ?from)
                    (clear ?to)
                    (move-dir-right ?from ?to))
            :effect (and
                    (not (at ?p ?from))
                    (not (clear ?to))
                    (at ?p ?to)
                    (clear ?from)
                    (not (oriented-down ?p))
                    (not (oriented-left ?p))
                    (not (oriented-up ?p))
                    (oriented-right ?p))
    )

)

; problem
(define (problem maze) (:domain maze)
  (:objects
        loc-1-1 - location
	loc-1-2 - location
	loc-1-3 - location
	loc-1-4 - location
	loc-1-5 - location
	loc-1-6 - location
	loc-2-1 - location
	loc-2-2 - location
	loc-2-3 - location
	loc-2-4 - location
	loc-2-5 - location
	loc-2-6 - location
	loc-3-1 - location
	loc-3-2 - location
	loc-3-3 - location
	loc-3-4 - location
	loc-3-5 - location
	loc-3-6 - location
	loc-4-1 - location
	loc-4-2 - location
	loc-4-3 - location
	loc-4-4 - location
	loc-4-5 - location
	loc-4-6 - location
	loc-5-1 - location
	loc-5-2 - location
	loc-5-3 - location
	loc-5-4 - location
	loc-5-5 - location
	loc-5-6 - location
	loc-6-1 - location
	loc-6-2 - location
	loc-6-3 - location
	loc-6-4 - location
	loc-6-5 - location
	loc-6-6 - location
	player-1 - player
  )
  (:init 
	(at player-1 loc-5-4)
	(clear loc-2-2)
	(clear loc-2-3)
	(clear loc-2-4)
	(clear loc-3-2)
	(clear loc-3-4)
	(clear loc-3-5)
	(clear loc-4-3)
	(clear loc-4-5)
	(clear loc-5-2)
	(clear loc-5-3)
	(clear loc-5-5)
	(is-goal loc-2-3)
	(move-dir-down loc-2-2 loc-3-2)
	(move-dir-down loc-2-4 loc-3-4)
	(move-dir-down loc-3-5 loc-4-5)
	(move-dir-down loc-4-3 loc-5-3)
	(move-dir-down loc-4-5 loc-5-5)
	(move-dir-left loc-2-3 loc-2-2)
	(move-dir-left loc-2-4 loc-2-3)
	(move-dir-left loc-3-5 loc-3-4)
	(move-dir-left loc-5-3 loc-5-2)
	(move-dir-left loc-5-4 loc-5-3)
	(move-dir-left loc-5-5 loc-5-4)
	(move-dir-right loc-2-2 loc-2-3)
	(move-dir-right loc-2-3 loc-2-4)
	(move-dir-right loc-3-4 loc-3-5)
	(move-dir-right loc-5-2 loc-5-3)
	(move-dir-right loc-5-3 loc-5-4)
	(move-dir-right loc-5-4 loc-5-5)
	(move-dir-up loc-3-2 loc-2-2)
	(move-dir-up loc-3-4 loc-2-4)
	(move-dir-up loc-4-5 loc-3-5)
	(move-dir-up loc-5-3 loc-4-3)
	(move-dir-up loc-5-5 loc-4-5)
	(oriented-right player-1)
  )
  (:goal (at player-1 loc-2-3))
)

; plan
1. (move-right player-1 loc-5-4 loc-5-5)
   deleted: (at player-1 loc-5-4) (clear loc-5-5)
   added: (at player-1 loc-5-5) (clear loc-5-4)
   goals met: 0 of 1
2. (move-up player-1 loc-5-5 loc-4-5)
   deleted: (at player-1 loc-5-5) (clear loc-4-5) (oriented-right player-1)
   added: (at player-1 loc-4-5) (clear loc-5-5) (oriented-up player-1)
   goals met: 0 of 1
3. (move-up player-1 loc-4-5 loc-3-5)
   deleted: (at player-1 loc-4-5) (clear loc-3-5)
   added: (at player-1 loc-3-5) (clear loc-4-5)
   goals met: 0 of 1
4. (move-left player-1 loc-3-5 loc-3-4)
   deleted: (at player-1 loc-3-5) (clear loc-3-4) (oriented-up player-1)
   added: (at player-1 loc-3-4) (clear loc-3-5) (oriented-left player-1)
   goals met: 0 of 1
5. (move-up player-1 loc-3-4 loc-2-4)
   deleted: (at player-1 loc-3-4) (clear loc-2-4) (oriented-left player-1)
   added: (at player-1 loc-2-4) (clear loc-3-4) (oriented-up player-1)
   goals met: 0 of 1
6. (move-left player-1 loc-2-4 loc-2-3)
   deleted: (at player-1 loc-2-4) (clear loc-2-3) (oriented-up player-1)
   added: (at player-1 loc-2-3) (clear loc-2-4) (oriented-left player-1)
   goals met: 1 of 1
